[
  {
    "isbn": "1640095411",
    "dateStarted": "2024-04-10",
    "status": "started",
    "rating": "unrated",
    "tags": [
      "nonfiction"
    ],
    "title": "Starkweather",
    "authors": [
      "Harry N. MacLean"
    ],
    "publishedDate": "2023-11-28",
    "description": "The definitive story of Charles Starkweather, often considered to be the first mass killer in the modern age of America On January 21, 1958, nineteen-year-old Charles Starkweather changed the course of crime in the United States when he murdered the parents and sister of his fourteen-year-old girlfriend (and possible accomplice), Caril Ann Fugate, in a house on the edge of Lincoln, Nebraska. They then drove to the nearby town of Bennet, where a farmer was robbed and killed. When Starkweather’s car broke down, the teenagers who stopped to help were murdered and jammed into a storm cellar. By the time the dust settled, ten innocent people were dead and the city of Lincoln was in a state of terror. Schools closed. Men with rifles perched on the roofs of their houses. The National Guard patrolled the street. If there is a cultural version of PTSD, the town suffered from it. Starkweather and Fugate’s capture and arrest, and the resulting trials about the killing spree, received worldwide coverage. The event would serve as the inspiration for the movie Natural Born Killers and Springsteen’s iconic album Nebraska. Today, the story has dropped far from the national consciousness. With new material, new reporting, and new conclusions about the possible guilt or innocence of Fugate, the tale is ripe for an updated and definitive retelling. In Starkweather, bestselling author Harry N. MacLean tells the story of this shocking event and its lasting impact, a crime spree that struck deep into the heart of the heartland.",
    "pageCount": 441,
    "printType": "BOOK",
    "categories": [
      "True Crime"
    ],
    "thumbnail": "https://books.google.com/books/content?id=VvOxEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api&w=512",
    "language": "en",
    "link": "https://books.google.com/books/about/Starkweather.html?hl=&id=VvOxEAAAQBAJ"
  },
  {
    "isbn": "0316462845",
    "dateStarted": "2024-03-02",
    "status": "started",
    "rating": "unrated",
    "tags": [
      "scifi"
    ],
    "title": "Machine Vendetta",
    "authors": [
      "Alastair Reynolds"
    ],
    "publishedDate": "2024-01-16",
    "description": "From the king of modern space opera comes a new adventure in the Prefect Dreyfus series--Machine Vendetta is a thrilling tale of deadly conspiracies and old enemies that refuse to die. Panoply is a small, efficient police force, dedicated to maintaining the rule of democracy among the ten thousand disparate city-states orbiting the planet Yellowstone. Ingvar Tench was one of Panoply's most experienced operatives. So why did she walk alone and unarmed into a habitat with a vicious grudge against her organization? As his colleagues pick up the pieces following her death, Prefect Tom Dreyfus must face his conscience. Four years ago, when an investigation linked to one of his most dangerous adversaries got a little too personal, Dreyfus arranged for Tench to continue the inquiry by proxy. In using her, did Dreyfus also put her in the line of fire? And what does Tench's attack tell him about an enemy he had hoped was dormant? The Prefect Dreyfus Emergencies Aurora Rising Elysium Fire Machine Vendetta",
    "pageCount": 0,
    "printType": "BOOK",
    "categories": [
      "Fiction"
    ],
    "thumbnail": "https://books.google.com/books/content?id=AGqYzwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api&w=512",
    "language": "en",
    "link": "https://books.google.com/books/about/Machine_Vendetta.html?hl=&id=AGqYzwEACAAJ"
  }
]