[
  {
    "isbn": "1640095411",
    "dateStarted": "2024-04-10",
    "status": "finished",
    "rating": "unrated",
    "tags": [
      "nonfiction"
    ],
    "title": "Starkweather",
    "authors": [
      "Harry N. MacLean"
    ],
    "publishedDate": "2023-11-28",
    "description": "The definitive story of Charles Starkweather, often considered to be the first mass killer in the modern age of America On January 21, 1958, nineteen-year-old Charles Starkweather changed the course of crime in the United States when he murdered the parents and sister of his fourteen-year-old girlfriend (and possible accomplice), Caril Ann Fugate, in a house on the edge of Lincoln, Nebraska. They then drove to the nearby town of Bennet, where a farmer was robbed and killed. When Starkweather’s car broke down, the teenagers who stopped to help were murdered and jammed into a storm cellar. By the time the dust settled, ten innocent people were dead and the city of Lincoln was in a state of terror. Schools closed. Men with rifles perched on the roofs of their houses. The National Guard patrolled the street. If there is a cultural version of PTSD, the town suffered from it. Starkweather and Fugate’s capture and arrest, and the resulting trials about the killing spree, received worldwide coverage. The event would serve as the inspiration for the movie Natural Born Killers and Springsteen’s iconic album Nebraska. Today, the story has dropped far from the national consciousness. With new material, new reporting, and new conclusions about the possible guilt or innocence of Fugate, the tale is ripe for an updated and definitive retelling. In Starkweather, bestselling author Harry N. MacLean tells the story of this shocking event and its lasting impact, a crime spree that struck deep into the heart of the heartland.",
    "pageCount": 441,
    "printType": "BOOK",
    "categories": [
      "True Crime"
    ],
    "thumbnail": "https://books.google.com/books/content?id=VvOxEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api&w=512",
    "language": "en",
    "link": "https://books.google.com/books/about/Starkweather.html?hl=&id=VvOxEAAAQBAJ",
    "dateFinished": "2024-04-20"
  },
  {
    "isbn": "0316462845",
    "dateStarted": "2024-03-02",
    "status": "started",
    "rating": "unrated",
    "tags": [
      "scifi"
    ],
    "title": "Machine Vendetta",
    "authors": [
      "Alastair Reynolds"
    ],
    "publishedDate": "2024-01-16",
    "description": "From the king of modern space opera comes a new adventure in the Prefect Dreyfus series--Machine Vendetta is a thrilling tale of deadly conspiracies and old enemies that refuse to die. Panoply is a small, efficient police force, dedicated to maintaining the rule of democracy among the ten thousand disparate city-states orbiting the planet Yellowstone. Ingvar Tench was one of Panoply's most experienced operatives. So why did she walk alone and unarmed into a habitat with a vicious grudge against her organization? As his colleagues pick up the pieces following her death, Prefect Tom Dreyfus must face his conscience. Four years ago, when an investigation linked to one of his most dangerous adversaries got a little too personal, Dreyfus arranged for Tench to continue the inquiry by proxy. In using her, did Dreyfus also put her in the line of fire? And what does Tench's attack tell him about an enemy he had hoped was dormant? The Prefect Dreyfus Emergencies Aurora Rising Elysium Fire Machine Vendetta",
    "pageCount": 0,
    "printType": "BOOK",
    "categories": [
      "Fiction"
    ],
    "thumbnail": "https://books.google.com/books/content?id=AGqYzwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api&w=512",
    "language": "en",
    "link": "https://books.google.com/books/about/Machine_Vendetta.html?hl=&id=AGqYzwEACAAJ"
  },
  {
    "isbn": "9780593237410",
    "dateStarted": "2024-04-20",
    "status": "started",
    "rating": "unrated",
    "tags": [
      "music",
      "nonfiction"
    ],
    "title": "Deliver Me from Nowhere",
    "authors": [
      "Warren Zanes"
    ],
    "publishedDate": "2023-05-02",
    "description": "The fascinating story behind the making of Bruce Springsteen’s most surprising album, Nebraska, revealing its pivotal role in Springsteen’s career Without Nebraska, Bruce Springsteen might not be who he is today. The natural follow-up to Springsteen’s hugely successful The River should have been the hit-packed album Born in the U.S.A, but instead, in 1982, he came out with Nebraska, an album consisting of a series of dark songs he had recorded exclusively by himself, for himself. But almost forty years later, Nebraska is arguably Springsteen’s most important record--the lasting clue if you’re looking to understand not just the artist’s career and the vision behind it but the man himself. Nebraska is rough and unfinished, recorded on a cassette tape with a simple four-track recorder by Springsteen, alone in his bedroom, just as the digital future was announcing itself. And yet Springsteen now considers it his best album. Nebraska expressed a turmoil that was reflective of a mood in the country but was also a symptom of trouble in the artist's life, the beginnings of a mental breakdown that Springsteen would only talk about openly decades after the album’s release. Warren Zanes spoke to many people involved with making Nebraska, including Bruce Springsteen. He also interviewed more than a dozen celebrated artists, from Rosanne Cash to Steven Van Zandt, about their reaction to the album. He interweaves these conversations with inquiries into the myriad cultural touchpoints, including Terence Malick’s Badlands, that influenced Springsteen as he was writing the album’s haunting songs. The result is a textured and revelatory account of not only a crucial moment in the career of an icon but also a recording that upended all expectations and predicted a home recording revolution.",
    "pageCount": 329,
    "printType": "BOOK",
    "categories": [
      "Music"
    ],
    "thumbnail": "https://books.google.com/books/content?id=dJ-WEAAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api&w=512",
    "language": "en",
    "link": "https://books.google.com/books/about/Deliver_Me_from_Nowhere.html?hl=&id=dJ-WEAAAQBAJ"
  },
  {
    "isbn": "9781524732851",
    "dateFinished": "2024-03-28",
    "status": "finished",
    "rating": "unrated",
    "tags": [
      "nonfiction",
      "climate"
    ],
    "title": "Fire Weather",
    "authors": [
      "John Vaillant"
    ],
    "publishedDate": "2023-06-06",
    "description": "A NEW YORK TIMES TOP TEN BOOK OF THE YEAR • FINALIST FOR THE NATIONAL BOOK AWARD IN NONFICTION • A stunning account of a colossal wildfire and a panoramic exploration of the rapidly changing relationship between fire and humankind from the award-winning, best-selling author of The Tiger and The Golden Spruce • Winner of the Baillie Gifford Prize for Non-Fiction A BEST BOOK OF THE YEAR: The New York Times, The Washington Post, The New Yorker, TIME, NPR, Slate, and Smithsonian “Grips like a philosophical thriller, warns like a beacon, and shocks to the core.\" —Robert Macfarlane, bestselling author of Underland “Riveting, spellbinding, astounding on every page.” —David Wallace-Wells, #1 bestselling author of The Uninhabitable Earth In May 2016, Fort McMurray, the hub of Canada’s oil industry and America’s biggest foreign supplier, was overrun by wildfire. The multi-billion-dollar disaster melted vehicles, turned entire neighborhoods into firebombs, and drove 88,000 people from their homes in a single afternoon. Through the lens of this apocalyptic conflagration—the wildfire equivalent of Hurricane Katrina—John Vaillant warns that this was not a unique event, but a shocking preview of what we must prepare for in a hotter, more flammable world. Fire has been a partner in our evolution for hundreds of millennia, shaping culture, civilization, and, very likely, our brains. Fire has enabled us to cook our food, defend and heat our homes, and power the machines that drive our titanic economy. Yet this volatile energy source has always threatened to elude our control, and in our new age of intensifying climate change, we are seeing its destructive power unleashed in previously unimaginable ways. With masterly prose and a cinematic eye, Vaillant takes us on a riveting journey through the intertwined histories of North America’s oil industry and the birth of climate science, to the unprecedented devastation wrought by modern forest fires, and into lives forever changed by these disasters. John Vaillant’s urgent work is a book for—and from—our new century of fire, which has only just begun.",
    "pageCount": 0,
    "printType": "BOOK",
    "categories": [
      "Nature"
    ],
    "thumbnail": "https://books.google.com/books/content?id=lJeTEAAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api&w=512",
    "language": "en",
    "link": "https://books.google.com/books/about/Fire_Weather.html?hl=&id=lJeTEAAAQBAJ"
  },
  {
    "isbn": "9780063037335",
    "dateFinished": "2024-04-03",
    "status": "finished",
    "rating": "unrated",
    "tags": [
      "nonfiction",
      "autobiography"
    ],
    "title": "Finding Me",
    "authors": [
      "Viola Davis"
    ],
    "publishedDate": "2022-04-26",
    "description": "OPRAH’S BOOK CLUB PICK • A HARPERS BAZAAR BEST BOOK OF 2022 • A PARADE MOST ANTICIPATED BOOK • A MARIE CLAIRE MOST ANTICIPATED BOOK “It’s clear from the first page that Davis is going to serve a more intimate, unpolished account than is typical of the average (often ghost-written) celebrity memoir; Finding Me reads like Davis is sitting you down for a one-on-one conversation about her life, warts and all.”—USA Today “[A] fulfilling narrative of struggle and success….Her gorgeous storytelling will inspire anyone wishing to shed old labels.”—Los Angeles Times In my book, you will meet a little girl named Viola who ran from her past until she made a life-changing decision to stop running forever. This is my story, from a crumbling apartment in Central Falls, Rhode Island, to the stage in New York City, and beyond. This is the path I took to finding my purpose but also my voice in a world that didn’t always see me. As I wrote Finding Me, my eyes were open to the truth of how our stories are often not given close examination. We are forced to reinvent them to fit into a crazy, competitive, judgmental world. So I wrote this for anyone running through life untethered, desperate and clawing their way through murky memories, trying to get to some form of self-love. For anyone who needs reminding that a life worth living can only be born from radical honesty and the courage to shed facades and be . . . you. Finding Me is a deep reflection, a promise, and a love letter of sorts to self. My hope is that my story will inspire you to light up your own life with creative expression and rediscover who you were before the world put a label on you.",
    "pageCount": 282,
    "printType": "BOOK",
    "categories": [
      "Biography & Autobiography"
    ],
    "thumbnail": "https://books.google.com/books/content?id=gl05EAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api&w=512",
    "language": "en",
    "link": "https://play.google.com/store/books/details?id=gl05EAAAQBAJ"
  },
  {
    "isbn": "9781039000780",
    "dateFinished": "2024-04-10",
    "status": "finished",
    "rating": "unrated",
    "tags": [
      "tech",
      "nonfiction"
    ],
    "title": "Sideways",
    "authors": [
      "Josh O'Kane"
    ],
    "publishedDate": "2022-09-13",
    "description": "NATIONAL BESTSELLER From the Globe and Mail tech reporter who revealed countless controversies while following the Sidewalk Labs fiasco in Toronto, an uncompromising investigation into the bigger story and what the Google sister company's failure there reveals about Big Tech, data privacy and the monetization of everything. When former New York deputy mayor Dan Doctoroff landed in Toronto, promising a revolution in better living through technology, the locals were starstruck. In 2017 a small parcel of land on the city's woefully underdeveloped lakeshore was available for development, and with Google co-founder Larry Page and his trusted chairman Eric Schmidt leaning into Sidewalk Labs' pitch for the long-forsaken property—with Doctoroff as the urban-planning company's CEO—Sidewalk's bid crushed the competition. But as soon as the bid was won, cracks appeared in the partnership between Doctoroff's team and Waterfront Toronto, the government-sponsored organization behind the contest. There were hundreds more acres of undeveloped former port lands nearby that kept creeping into conversation with Sidewalk, and more questions were emerging than answers about how much the public would actually benefit from the Alphabet-owned company's vision for the high-tech neighbourhood—and the data it could harvest from the people living there. Alarm bells began ringing in the city's corridors of power and activism. To Torontonians accustomed to big promises with little follow-through, the fiasco that unfolded seemed at first like just another city-building sideshow. But the pained battle to reel in the power of Sidewalk Labs became a crucible moment in the worldwide battle for privacy rights and against the extension of Big Tech’s digital might into the physical world around us. With extensive contacts on all sides of the debacle, O'Kane tells a story of global consequence fought over a small, forgotten parcel of mud and pavement, taking readers from California to New York to Toronto to Berlin and back again. In the tradition of extraordinary boardroom dramas like Bad Blood and Super Pumped, Sideways vividly recreates the corporate drama and epic personalities in this David-and-Goliath battle that signalled to the world that all may not be lost in the effort to contain the rapidly growing power of Big Tech.",
    "pageCount": 0,
    "printType": "BOOK",
    "categories": [
      "Business & Economics"
    ],
    "thumbnail": "https://books.google.com/books/content?id=GJKTEAAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api&w=512",
    "language": "en",
    "link": "https://books.google.com/books/about/Sideways.html?hl=&id=GJKTEAAAQBAJ"
  }
]