[
  {
    "isbn": "1640095411",
    "dateStarted": "2024-04-10",
    "status": "finished",
    "rating": "unrated",
    "tags": [
      "nonfiction"
    ],
    "title": "Starkweather",
    "authors": [
      "Harry N. MacLean"
    ],
    "publishedDate": "2023-11-28",
    "description": "The definitive story of Charles Starkweather, often considered to be the first mass killer in the modern age of America On January 21, 1958, nineteen-year-old Charles Starkweather changed the course of crime in the United States when he murdered the parents and sister of his fourteen-year-old girlfriend (and possible accomplice), Caril Ann Fugate, in a house on the edge of Lincoln, Nebraska. They then drove to the nearby town of Bennet, where a farmer was robbed and killed. When Starkweather’s car broke down, the teenagers who stopped to help were murdered and jammed into a storm cellar. By the time the dust settled, ten innocent people were dead and the city of Lincoln was in a state of terror. Schools closed. Men with rifles perched on the roofs of their houses. The National Guard patrolled the street. If there is a cultural version of PTSD, the town suffered from it. Starkweather and Fugate’s capture and arrest, and the resulting trials about the killing spree, received worldwide coverage. The event would serve as the inspiration for the movie Natural Born Killers and Springsteen’s iconic album Nebraska. Today, the story has dropped far from the national consciousness. With new material, new reporting, and new conclusions about the possible guilt or innocence of Fugate, the tale is ripe for an updated and definitive retelling. In Starkweather, bestselling author Harry N. MacLean tells the story of this shocking event and its lasting impact, a crime spree that struck deep into the heart of the heartland.",
    "pageCount": 441,
    "printType": "BOOK",
    "categories": [
      "True Crime"
    ],
    "thumbnail": "https://books.google.com/books/content?id=VvOxEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api&w=512",
    "language": "en",
    "link": "https://books.google.com/books/about/Starkweather.html?hl=&id=VvOxEAAAQBAJ",
    "dateFinished": "2024-04-20"
  },
  {
    "isbn": "0316462845",
    "dateStarted": "2024-03-02",
    "status": "started",
    "rating": "unrated",
    "tags": [
      "scifi"
    ],
    "title": "Machine Vendetta",
    "authors": [
      "Alastair Reynolds"
    ],
    "publishedDate": "2024-01-16",
    "description": "From the king of modern space opera comes a new adventure in the Prefect Dreyfus series--Machine Vendetta is a thrilling tale of deadly conspiracies and old enemies that refuse to die. Panoply is a small, efficient police force, dedicated to maintaining the rule of democracy among the ten thousand disparate city-states orbiting the planet Yellowstone. Ingvar Tench was one of Panoply's most experienced operatives. So why did she walk alone and unarmed into a habitat with a vicious grudge against her organization? As his colleagues pick up the pieces following her death, Prefect Tom Dreyfus must face his conscience. Four years ago, when an investigation linked to one of his most dangerous adversaries got a little too personal, Dreyfus arranged for Tench to continue the inquiry by proxy. In using her, did Dreyfus also put her in the line of fire? And what does Tench's attack tell him about an enemy he had hoped was dormant? The Prefect Dreyfus Emergencies Aurora Rising Elysium Fire Machine Vendetta",
    "pageCount": 0,
    "printType": "BOOK",
    "categories": [
      "Fiction"
    ],
    "thumbnail": "https://books.google.com/books/content?id=AGqYzwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api&w=512",
    "language": "en",
    "link": "https://books.google.com/books/about/Machine_Vendetta.html?hl=&id=AGqYzwEACAAJ"
  },
  {
    "isbn": "9780593237410",
    "dateStarted": "2024-04-20",
    "status": "started",
    "rating": "unrated",
    "tags": [
      "music",
      "nonfiction"
    ],
    "title": "Deliver Me from Nowhere",
    "authors": [
      "Warren Zanes"
    ],
    "publishedDate": "2023-05-02",
    "description": "The fascinating story behind the making of Bruce Springsteen’s most surprising album, Nebraska, revealing its pivotal role in Springsteen’s career Without Nebraska, Bruce Springsteen might not be who he is today. The natural follow-up to Springsteen’s hugely successful The River should have been the hit-packed album Born in the U.S.A, but instead, in 1982, he came out with Nebraska, an album consisting of a series of dark songs he had recorded exclusively by himself, for himself. But almost forty years later, Nebraska is arguably Springsteen’s most important record--the lasting clue if you’re looking to understand not just the artist’s career and the vision behind it but the man himself. Nebraska is rough and unfinished, recorded on a cassette tape with a simple four-track recorder by Springsteen, alone in his bedroom, just as the digital future was announcing itself. And yet Springsteen now considers it his best album. Nebraska expressed a turmoil that was reflective of a mood in the country but was also a symptom of trouble in the artist's life, the beginnings of a mental breakdown that Springsteen would only talk about openly decades after the album’s release. Warren Zanes spoke to many people involved with making Nebraska, including Bruce Springsteen. He also interviewed more than a dozen celebrated artists, from Rosanne Cash to Steven Van Zandt, about their reaction to the album. He interweaves these conversations with inquiries into the myriad cultural touchpoints, including Terence Malick’s Badlands, that influenced Springsteen as he was writing the album’s haunting songs. The result is a textured and revelatory account of not only a crucial moment in the career of an icon but also a recording that upended all expectations and predicted a home recording revolution.",
    "pageCount": 329,
    "printType": "BOOK",
    "categories": [
      "Music"
    ],
    "thumbnail": "https://books.google.com/books/content?id=dJ-WEAAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api&w=512",
    "language": "en",
    "link": "https://books.google.com/books/about/Deliver_Me_from_Nowhere.html?hl=&id=dJ-WEAAAQBAJ"
  },
  {
    "isbn": "9781847927279",
    "dateFinished": "2024-02-16",
    "status": "finished",
    "rating": "unrated",
    "tags": [
      "tech",
      "economics"
    ],
    "title": "Technofeudalism",
    "authors": [
      "Yanis Varoufakis"
    ],
    "publishedDate": "2023-09-28",
    "description": "Capitalism is dead. The #1 bestselling economist shows how the owners of big tech have become the world's feudal overlords. 'What an amazing piece of work this is. Everyone should read it. 100 out of 100' IRVINE WELSH In his boldest and most far-reaching book yet, world-famous economist Yanis Varoufakis argues that capitalism is dead and a new economic era has begun. Insane sums of money that were supposed to re-float our economies in the wake of the financial crisis and the pandemic have ended up supercharging big tech's hold over every aspect of the economy. Capitalism's twin pillars - markets and profit - have been replaced with big tech's platforms and rents. Meanwhile, with every click and scroll, we labour like serfs to increase its power. Welcome to technofeudalism. Drawing on stories from Greek Myth and pop culture, from Homer to Mad Men, Varoufakis explains this revolutionary transformation: how it enslaves our minds, how it rewrites the rules of global power and ultimately what it will take overthrow it. 'An important new book' Carole Cadwalladr, Observer 'With superb storytelling, Varoufakis shows how capitalism has eaten itself alive' Brett Scott, author of Cloudmoney 'Provocative and accessible, this is sure to be a key touchstone in debates about the future of the global economy' Nick Srnicek, co-author of Inventing the Future",
    "pageCount": 0,
    "printType": "BOOK",
    "categories": [
      "Big data"
    ],
    "thumbnail": "https://books.google.com/books/content?id=tbqazwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api&w=512",
    "language": "en",
    "link": "https://books.google.com/books/about/Technofeudalism.html?hl=&id=tbqazwEACAAJ"
  },
  {
    "isbn": "9780593593950",
    "dateFinished": "2024-02-17",
    "status": "finished",
    "rating": "unrated",
    "tags": [
      "tech"
    ],
    "title": "The Coming Wave",
    "authors": [
      "Mustafa Suleyman"
    ],
    "publishedDate": "2023-09-05",
    "description": "NEW YORK TIMES BESTSELLER • An urgent warning of the unprecedented risks that AI and other fast-developing technologies pose to global order, and how we might contain them while we have the chance—from a co-founder of the pioneering artificial intelligence company DeepMind “A fascinating, well-written, and important book.”—Yuval Noah Harari “Essential reading.”—Daniel Kahneman “An excellent guide for navigating unprecedented times.”—Bill Gates A Best Book of the Year: Economist, Financial Times, CEO Magazine • Winner of the Inc. Non-Obvious Book Award • Finalist for the Porchlight Business Book Award and the Financial Times and Schroders Business Book of the Year Award We are approaching a critical threshold in the history of our species. Everything is about to change. Soon you will live surrounded by AIs. They will organise your life, operate your business, and run core government services. You will live in a world of DNA printers and quantum computers, engineered pathogens and autonomous weapons, robot assistants and abundant energy. None of us are prepared. As co-founder of the pioneering AI company DeepMind, part of Google, Mustafa Suleyman has been at the centre of this revolution. The coming decade, he argues, will be defined by this wave of powerful, fast-proliferating new technologies. In The Coming Wave, Suleyman shows how these forces will create immense prosperity but also threaten the nation-state, the foundation of global order. As our fragile governments sleepwalk into disaster, we face an existential dilemma: unprecedented harms on one side, the threat of overbearing surveillance on the other. Can we forge a narrow path between catastrophe and dystopia? This groundbreaking book from the ultimate AI insider establishes “the containment problem”—the task of maintaining control over powerful technologies—as the essential challenge of our age.",
    "pageCount": 353,
    "printType": "BOOK",
    "categories": [
      "Technology & Engineering"
    ],
    "thumbnail": "https://books.google.com/books/content?id=a-26EAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api&w=512",
    "language": "en",
    "link": "https://books.google.com/books/about/The_Coming_Wave.html?hl=&id=a-26EAAAQBAJ"
  },
  {
    "isbn": "9780375706677",
    "dateFinished": "2024-02-17",
    "status": "finished",
    "rating": "unrated",
    "tags": [
      "fiction"
    ],
    "title": "No Country for Old Men",
    "authors": [
      "Cormac McCarthy"
    ],
    "publishedDate": "2006",
    "description": "Stumbling upon a bloody massacre, a cache of heroin, and more than two million in cash during a hunting trip, Llewelyn Moss removes the money, a decision that draws him and his young wife into the middle of a violent confrontation.",
    "pageCount": 309,
    "printType": "BOOK",
    "categories": [
      "Fiction"
    ],
    "thumbnail": "https://books.google.com/books/content?id=TGQDed2zvh8C&printsec=frontcover&img=1&zoom=1&source=gbs_api&w=512",
    "language": "en",
    "link": "https://books.google.com/books/about/No_Country_for_Old_Men.html?hl=&id=TGQDed2zvh8C"
  },
  {
    "isbn": "9780333717523",
    "dateFinished": "2024-02-19",
    "status": "finished",
    "rating": "unrated",
    "tags": [
      "nonfiction"
    ],
    "title": "Into Thin Air",
    "authors": [
      "Jon Krakauer"
    ],
    "publishedDate": "1997",
    "description": "Journalist Krakauer, standing on the summit of Mt. Everest, saw nothing that \"suggested that a murderous storm was bearing down.\" He was wrong. The storm, which claimed five lives and left countless more in guilt-ridden disarray, would also provide the impetus for this epic account of the May 1996 disaster. Unabridged. 7 CDs.",
    "pageCount": 293,
    "printType": "BOOK",
    "categories": [
      "Mountaineering"
    ],
    "language": "en",
    "link": "https://books.google.com/books/about/Into_Thin_Air.html?hl=&id=nEVCPgAACAAJ"
  },
  {
    "isbn": "9780593716601",
    "dateFinished": "2024-02-21",
    "status": "finished",
    "rating": "unrated",
    "tags": [
      "tech",
      "nonfiction"
    ],
    "title": "Extremely Hardcore",
    "authors": [
      "Zoë Schiffer"
    ],
    "publishedDate": "2024-02-13",
    "description": "\"Zoë Schiffer has written the definitive book on perhaps the weirdest business story of our time. A fast-paced and riveting account of a hilarious and tragic mess.\" — Matt Levine, Bloomberg Opinion “Money Stuff” columnist “the bird is freed” - Elon Musk (@elonmusk) October 27, 2022 When Elon Musk took over Twitter, commentators were rooting for the visionary behind Tesla and SpaceX to succeed. Here was a tough leader who could grab back power from Twitter’s entitled workforce, motivate them to get “extremely hardcore,” and supercharge Twitter’s profit and potential. And it was all out of the goodness of his own heart, rooted in his fervent belief in the necessity of making Twitter friendlier to free speech. \"I didn’t do it to make more money,” Musk said. “I did it to try and help humanity, whom I love.” Once Musk charged into the Twitter headquarters, the command-and-control playbook Musk honed at Tesla and SpaceX went off the rails immediately. Distilling hundreds of hours of interviews with more than sixty employees, thousands of pages of internal documents, Slack messages, presentations, as well as court filings and congressional testimony, Extremely Hardcore is the true story of how Musk reshaped the world’s online public square into his own personal megaphone. You’ll hear from employees who witnessed the destruction of their workplace in real-time, seeing years of progress to fight disinformation and hate speech wiped out within a matter of months. There’s the machine-learning savant who went all-in on Twitter 2.0 before getting betrayed by his new CEO, the father whose need for healthcare swept him into Musk’s inner circle, the trust and safety expert who became the subject of a harassment campaign his former boss incited, and the many other employees who tried to save the company from their new boss’s worst instincts. This is the story of Twitter, but it’s also a chronicle of the post-pandemic labor movement, a war between executives and a workforce newly awakened to their rights and needs. Riveting, character-driven, and filled with jaw-dropping revelations, Extremely Hardcore is the definitive, fly-on-the-wall story of how Elon Musk lit $44 billion on fire and burned down Twitter. It’s the next best thing to being there, and you won’t have to sleep in the Twitter office to get the scoop.",
    "pageCount": 353,
    "printType": "BOOK",
    "categories": [
      "Business & Economics"
    ],
    "thumbnail": "https://books.google.com/books/content?id=FsTlEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api&w=512",
    "language": "en",
    "link": "https://books.google.com/books/about/Extremely_Hardcore.html?hl=&id=FsTlEAAAQBAJ"
  },
  {
    "isbn": "9781524760595",
    "dateFinished": "2024-02-25",
    "status": "finished",
    "rating": "unrated",
    "tags": [
      "nonfiction"
    ],
    "title": "Between Two Fires",
    "authors": [
      "Joshua Yaffa"
    ],
    "publishedDate": "2020",
    "description": "From a leading journalist in Moscow and correspondent for The New Yorker, a groundbreaking portrait of modern Russia and the inner struggles of the people who sustain Vladimir Putin's rule \"Unforgettable. . . . This is a book about Putin's Russia that is unlike any other.\" --Patrick Radden Keefe, author of Say Nothing In this rich and novelistic tour of contemporary Russia, Joshua Yaffa introduces readers to some of the country's most remarkable figures--from politicians and entrepreneurs to artists and historians--who have built their careers and constructed their identities in the shadow of the Putin system. Torn between their own ambitions and the omnipresent demands of the state, each walks an individual path of compromise. Some muster cunning and cynicism to extract all manner of benefits and privileges from those in power. Others, finding themselves to be less adept, are left broken and demoralized. What binds them together is the tangled web of dilemmas and contradictions they face. Between Two Fires chronicles the lives of a number of strivers who understand that their dreams are best--or only--realized through varying degrees of cooperation with the Russian government. With sensitivity and depth, Yaffa profiles the director of the country's main television channel, an Orthodox priest at war with the church hierarchy, a Chechen humanitarian who turns a blind eye to persecutions, and many others. The result is an intimate and probing portrait of a nation that is much discussed yet little understood. By showing how citizens shape their lives around the demands of a capricious and frequently repressive state--as often by choice as under threat of force--Yaffa offers urgent lessons about the true nature of modern authoritarianism.",
    "pageCount": 372,
    "printType": "BOOK",
    "categories": [
      "Biography & Autobiography"
    ],
    "thumbnail": "https://books.google.com/books/content?id=H-jEDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api&w=512",
    "language": "en",
    "link": "https://books.google.com/books/about/Between_Two_Fires.html?hl=&id=H-jEDwAAQBAJ"
  },
  {
    "isbn": "9781523004775",
    "dateFinished": "2024-02-26",
    "status": "finished",
    "rating": "unrated",
    "tags": [
      "nonfiction",
      "economics"
    ],
    "title": "Wealth Supremacy",
    "authors": [
      "Marjorie Kelly"
    ],
    "publishedDate": "2023-09-12",
    "description": "A powerful analysis of how the bias towards wealth that is woven into the very fabric of American capitalism is damaging people, the economy, and the planet, and what the foundations of a new economy could be. This bold manifesto exposes seven myths underlying wealth supremacy, the bias that institutionalizes infinite extraction of wealth by and for the wealthy, and is the hidden force behind economic injustice, the climate crisis, and so many other problems of our day: The Myth of Maximizing: No amount of wealth is ever enough. The Myth of Fiduciary Duty: Corporate managers' most sacred duty is to expand capital. The Myth of Corporate Governance: Corporate membership must be reserved for capital alone. The Myth of the Income Statement: Income to capital must always be increased, while income to labor must always be decreased. The Myth of Materiality: Profit--material gain--alone is real, while social and environmental damages are not. The Myth of Takings: The first duty of government must be the protection of private property. The Myth of the Free Market: There should be no limits on the field of action of corporations and capital. Kelly argues instead for the democratization of ownership: public ownership of vital services, worker-owned businesses, and more. And she sketches the outlines of a non-extractive capitalism that would be subordinate to the public interest. This is an ambitious reimagining of the very foundations of our economy and society.",
    "pageCount": 0,
    "printType": "BOOK",
    "categories": [
      "Business & Economics"
    ],
    "thumbnail": "https://books.google.com/books/content?id=f8OSzwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api&w=512",
    "language": "en",
    "link": "https://books.google.com/books/about/Wealth_Supremacy.html?hl=&id=f8OSzwEACAAJ"
  },
  {
    "isbn": "9780593594841",
    "dateFinished": "2024-02-28",
    "status": "finished",
    "rating": "unrated",
    "tags": [
      "nonfiction"
    ],
    "title": "The Secret Gate",
    "authors": [
      "Mitchell Zuckoff"
    ],
    "publishedDate": "2023-04-25",
    "description": "The incredible true story of a breathtaking rescue in the frenzied final hours of the U.S. evacuation of Afghanistan—and how a brave Afghan mother and a compassionate American officer engineered a daring escape—from the #1 New York Times bestselling author of 13 Hours When the U.S. began its withdrawal from Afghanistan and the Afghan Army instantly collapsed, Homeira Qaderi was marked for death at the hands of the Taliban. A celebrated author, academic, and champion for women's liberation, Homeira had achieved celebrity in her home country by winning custody of her son in a contentious divorce, a rarity in Afghanistan's patriarchal society. As evacuation planes departed above, Homeira was caught in the turmoil at the Kabul Airport, trying and failing to secure escape for her and her eight-year-old son, Siawash, along with her parents and the rest of their family. Meanwhile, a young American diplomat named Sam Aronson was enjoying a brief vacation between assignments when chaos descended upon Afghanistan. Sam immediately volunteered to join the skeleton team of remaining officials at Kabul Airport, frantically racing to help rescue the more than 100,000 stranded Americans and their Afghan helpers. When Sam learned that the CIA had established a secret entrance into the airport two miles away from the desperate crowds crushing toward the gates, he started bringing families directly through, personally rescuing as many as fifty-two people in a single day. On the last day of the evacuation, Sam was contacted by Homeira's literary agent, who persuaded him to help her escape. He needed to risk his life to get them through the gate in the final hours before it closed forever. He borrowed night-vision goggles and enlisted a Dari-speaking colleague and two heavily armed security contract “shooters.” He contacted Homeira with a burner phone, and they used a flashlight code signal borrowed from boyhood summer camp. For her part, Homeira broke Sam’s rules and withstood his profanities. Together they braved gunfire by Afghan Army soldiers anxious about the restive crowds outside the airport. Ultimately, to enter the airport, Homeira and Siawash would have to leave behind their family and everything they had ever known. The Secret Gate tells the thrilling, emotional tale of a young man's courage and a mother and son’s skin-of-the-teeth escape from a homeland that is no longer their own.",
    "pageCount": 337,
    "printType": "BOOK",
    "categories": [
      "Political Science"
    ],
    "thumbnail": "https://books.google.com/books/content?id=dSSFEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api&w=512",
    "language": "en",
    "link": "https://books.google.com/books/about/The_Secret_Gate.html?hl=&id=dSSFEAAAQBAJ"
  },
  {
    "isbn": "9781736205907",
    "dateFinished": "2024-02-29",
    "status": "finished",
    "rating": "unrated",
    "tags": [
      "tech",
      "economics"
    ],
    "title": "How to Destroy Surveillance Capitalism",
    "authors": [
      "Cory Doctorow"
    ],
    "publishedDate": "2020-12-29",
    "description": "OneZero, Medium's official technology publication, is thrilled to announce a print-on-demand edition of How to Destroy Surveillance Capitalism by Cory Doctorow, with an exclusive new chapter. How to Destroy Surveillance Capitalism was first published online in August, where it was an instant hit with readers, scholars, and critics alike. For years now, we've been hearing about the ills of surveillance capitalism - the business of extracting, collecting, and selling vast reams of user data that has exploded with the rise of tech giants like Google, Facebook, and Amazon. But what if everything we've been hearing is wrong? What if surveillance capitalism is not some rogue capitalism or a wrong turn taken by some misguided corporations? What if the system is working exactly as intended - and the only hope of restoring an open web is to take the fight directly to the system itself? In Doctorow's timely and crucial new nonfiction work, the internationally bestselling author of Walkaway, Down and Out in the Magic Kingdom, and Little Brother, argues that if we're to have any hope of destroying surveillance capitalism, we're going to have to destroy the monopolies that currently comprise the commercial web as we know it. Only by breaking apart the tech giants that totally control our online experiences can we hope to return to a more open and free web - one where predatory data-harvesting is not a founding principle. Doctorow shows how, despite popular misconception, Facebook and Google do not possess any \"mind-control rays\" capable of brainwashing users into, say, voting for a presidential candidate or joining an extremist group - they have simply used their monopoly power to profit mightily off of people interested in doing those things and made it easy for them to find each other.Doctorow takes us on a whirlwind tour of the last 30 years of digital rights battles and the history of American monopoly - and where the two intersect. Through a deeply compelling and highly readable narrative, he makes the case for breaking up Google, Facebook, Amazon, and Apple as a means of ending surveillance capitalism.",
    "pageCount": 0,
    "printType": "BOOK",
    "thumbnail": "https://books.google.com/books/content?id=W20NzgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api&w=512",
    "language": "en",
    "link": "https://books.google.com/books/about/How_to_Destroy_Surveillance_Capitalism.html?hl=&id=W20NzgEACAAJ"
  },
  {
    "isbn": "9780765312181",
    "dateFinished": "2024-03-01",
    "status": "finished",
    "rating": "unrated",
    "tags": [
      "scifi"
    ],
    "title": "Blindsight",
    "authors": [
      "Peter Watts"
    ],
    "publishedDate": "2006-10-03",
    "description": "Two months since the stars fell... Two months since sixty-five thousand alien objects clenched around the Earth like a luminous fist, screaming to the heavens as the atmosphere burned them to ash. Two months since that moment of brief, bright surveillance by agents unknown. Two months of silence, while a world holds its breath. Now some half-derelict space probe, sparking fitfully past Neptune's orbit, hears a whisper from the edge of the solar system: a faint signal sweeping the cosmos like a lighthouse beam. Whatever's out there isn't talking to us. It's talking to some distant star, perhaps. Or perhaps to something closer, something en route. So who do you send to force introductions on an intelligence with motives unknown, maybe unknowable? Who do you send to meet the alien when the alien doesn't want to meet? You send a linguist with multiple personalities, her brain surgically partitioned into separate, sentient processing cores. You send a biologist so radically interfaced with machinery that he sees x-rays and tastes ultrasound, so compromised by grafts and splices he no longer feels his own flesh. You send a pacifist warrior in the faint hope she won't be needed, and the fainter one she'll do any good if she is. You send a monster to command them all, an extinct hominid predator once called vampire, recalled from the grave with the voodoo of recombinant genetics and the blood of sociopaths. And you send a synthesist--an informational topologist with half his mind gone--as an interface between here and there, a conduit through which the Dead Center might hope to understand the Bleeding Edge. You send them all to the edge of interstellar space, praying you can trust such freaks and retrofits with the fate of a world. You fear they may be more alien than the thing they've been sent to find. But you'd give anything for that to be true, if you only knew what was waiting for them...",
    "pageCount": 384,
    "printType": "BOOK",
    "categories": [
      "Fiction"
    ],
    "thumbnail": "https://books.google.com/books/content?id=th7gwAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api&w=512",
    "language": "en",
    "link": "https://books.google.com/books/about/Blindsight.html?hl=&id=th7gwAEACAAJ"
  },
  {
    "isbn": "9780593491799",
    "dateFinished": "2024-03-01",
    "status": "finished",
    "rating": "unrated",
    "tags": [
      "nonfiction"
    ],
    "title": "Waiting to Be Arrested at Night",
    "authors": [
      "Tahir Hamut Izgil"
    ],
    "publishedDate": "2023-08-01",
    "description": "Named one of the best books of the year by: THE NEW YORK TIMES • THE WASHINGTON POST • THE ECONOMIST • TIME A poet's account of one of the world's most urgent humanitarian crises, and a harrowing tale of a family's escape from genocide One by one, Tahir Hamut Izgil's friends disappeared. The Chinese government's brutal persecution of the Uyghur people had continued for years, but in 2017 it assumed a terrifying new scale. The Uyghurs, a predominantly Muslim minority group in western China, were experiencing an echo of the worst horrors of the twentieth century, amplified by China's establishment of an all-seeing high-tech surveillance state. Over a million people have vanished into China’s internment camps for Muslim minorities. Tahir, a prominent poet and intellectual, had been no stranger to persecution. After he attempted to travel abroad in 1996, police tortured him until he confessed to fabricated charges and sent him to a re-education through labor camp. But even having endured three years in the camp, he could never have predicted the Chinese government’s radical solution to the Uyghur question two decades later. Was the first sign when Tahir was interrogated for hours after a phone call with a fellow poet in the Netherlands? Or when his old friend was sentenced to life in prison simply for calling for Uyghurs' legal rights to be enforced? Perhaps it was when the police seized Uyghurs’ radios and installed jamming equipment to cut them off from the outside world. Once Tahir noticed that the park near his home was nearly empty because so many neighbors had been arrested, he knew the police would be coming for him any day. One night, after Tahir’s daughters were asleep, he placed by his door a sturdy pair of shoes, a sweater, and a coat so that he could stay warm if the police came for him in the middle of the night. It was clear to Tahir and his wife that fleeing the country was the family's only hope. Waiting to Be Arrested at Night is the story of the political, social, and cultural destruction of Tahir Hamut Izgil's homeland. Among leading Uyghur intellectuals and writers, he is the only one known to have escaped China since the mass internments began. His book is a call for the world to awaken to the unfolding catastrophe, and a tribute to his friends and fellow Uyghurs whose voices have been silenced.",
    "pageCount": 273,
    "printType": "BOOK",
    "categories": [
      "Biography & Autobiography"
    ],
    "thumbnail": "https://books.google.com/books/content?id=UIuZEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api&w=512",
    "language": "en",
    "link": "https://books.google.com/books/about/Waiting_to_Be_Arrested_at_Night.html?hl=&id=UIuZEAAAQBAJ"
  },
  {
    "isbn": "9781466876477",
    "dateFinished": "2024-03-02",
    "status": "finished",
    "rating": "unrated",
    "tags": [
      "scifi"
    ],
    "title": "The Colonel",
    "authors": [
      "Peter Watts"
    ],
    "publishedDate": "2014-07-29",
    "description": "Colonel Keaton is in trouble. His wife has retreated into a virtual heaven and his son remains missing after joining an extrasolar mission to track down an alien race. He is presently tasked by his superiors with the threat assessment of hived human intelligences, one of which successfully attacks a compound under his watch. Now, one of the strongest hive minds in the world approaches Keaton with an offer that could completely change his world. At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.",
    "pageCount": 32,
    "printType": "BOOK",
    "categories": [
      "Fiction"
    ],
    "thumbnail": "https://books.google.com/books/content?id=PWvfAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api&w=512",
    "language": "en",
    "link": "https://play.google.com/store/books/details?id=PWvfAwAAQBAJ"
  },
  {
    "isbn": "9780593443224",
    "dateFinished": "2024-03-03",
    "status": "finished",
    "rating": "unrated",
    "tags": [
      "nonfiction",
      "politics"
    ],
    "title": "Means of Control",
    "authors": [
      "Byron Tau"
    ],
    "publishedDate": "2024-02-27",
    "description": "You are being surveilled right now. This sweeping exposé reveals how the U.S. government allied with data brokers, tech companies, and advertisers to monitor us through the phones we carry and the devices in our home. “A revealing . . . startling . . . timely . . . fascinating, sometimes terrifying examination of the decline of privacy in the digital age.”—Kirkus Reviews “That evening, I was given a glimpse inside a hidden world. . . . An entirely new kind of surveillance program—one designed to track everyone.” For the past five years—ever since a chance encounter at a dinner party—journalist Byron Tau has been piecing together a secret story: how the whole of the internet and every digital device in the world became a mechanism of intelligence, surveillance, and monitoring. Of course, our modern world is awash in surveillance. Most of us are dimly aware of this: Ever get the sense that an ad is “following” you around the internet? But the true potential of our phones, computers, homes, credit cards, and even the tires underneath our cars to reveal our habits and behavior would astonish most citizens. All of this surveillance has produced an extraordinary amount of valuable data about every one of us. That data is for sale—and the biggest customer is the U.S. government. In the years after 9/11, the U.S. government, working with scores of anonymous companies, many scattered across bland Northern Virginia suburbs, built a foreign and domestic surveillance apparatus of breathtaking scope—one that can peer into the lives of nearly everyone on the planet. This cottage industry of data brokers and government bureaucrats has one directive—“get everything you can”—and the result is a surreal world in which defense contractors have marketing subsidiaries and marketing companies have defense contractor subsidiaries. And the public knows virtually nothing about it. Sobering and revelatory, Means of Control is the defining story of our dangerous grand bargain—ubiquitous cheap technology, but at what price?",
    "pageCount": 401,
    "printType": "BOOK",
    "categories": [
      "Business & Economics"
    ],
    "thumbnail": "https://books.google.com/books/content?id=3gzKEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api&w=512",
    "language": "en",
    "link": "https://books.google.com/books/about/Means_of_Control.html?hl=&id=3gzKEAAAQBAJ"
  },
  {
    "isbn": "9780593299456",
    "dateFinished": "2024-03-07",
    "status": "finished",
    "rating": "unrated",
    "tags": [
      "nonfiction",
      "politics"
    ],
    "title": "Under the Eye of Power",
    "authors": [
      "Colin Dickey"
    ],
    "publishedDate": "2023-07-11",
    "description": "From beloved cultural historian and acclaimed author of Ghostland comes a history of America's obsession with secret societies and the conspiracies of hidden power The United States was born in paranoia. From the American Revolution (thought by some to be a conspiracy organized by the French) to the Salem witch trials to the Satanic Panic, the Illuminati, and QAnon, one of the most enduring narratives that defines the United States is simply this: secret groups are conspiring to pervert the will of the people and the rule of law. We’d like to assume these panics exist only at the fringes of society, or are unique features of the internet age. But history tells us, in fact, that they are woven into the fabric of American democracy. Cultural historian Colin Dickey has built a career studying how our most irrational beliefs reach the mainstream, why, and what they tell us about ourselves. In Under the Eye of Power, Dickey charts the history of America through its paranoias and fears of secret societies, while seeking to explain why so many people—including some of the most powerful people in the country—continue to subscribe to these conspiracy theories. Paradoxically, he finds, belief in the fantastical and conspiratorial can be more soothing than what we fear the most: the chaos and randomness of history, the rising and falling of fortunes in America, and the messiness of democracy. Only in seeing the cycle of this history, Dickey says, can we break it.",
    "pageCount": 369,
    "printType": "BOOK",
    "categories": [
      "Social Science"
    ],
    "thumbnail": "https://books.google.com/books/content?id=H86UEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api&w=512",
    "language": "en",
    "link": "https://books.google.com/books/about/Under_the_Eye_of_Power.html?hl=&id=H86UEAAAQBAJ"
  },
  {
    "isbn": "9780525561019",
    "dateFinished": "2024-03-15",
    "status": "finished",
    "rating": "unrated",
    "tags": [
      "music",
      "nonfiction"
    ],
    "title": "3 Shades of Blue",
    "authors": [
      "James Kaplan"
    ],
    "publishedDate": "2024-03-05",
    "description": "From the author of the definitive biography of Frank Sinatra, the story of how jazz arrived at the pinnacle of American culture in 1959, told through the journey of three towering artists—Miles Davis, John Coltrane, and Bill Evans—who came together to create the most iconic jazz album of all time, Kind of Blue The myth of the ’60s depends on the 1950s being the “before times” of conformity, segregation, straightness—The Lonely Crowd and The Organization Man. This all carries some truth, but it does nothing to explain how, in 1959, America’s great indigenous art form, jazz, reached the height of its power and popularity, thanks to a number of Black geniuses so legendary they go by one name—Monk, Mingus, Rollins, Coltrane, and, above all, Miles. Nineteen fifty-nine saw Miles, Coltrane, Bill Evans, and more come together to record what is widely considered the greatest jazz album of all time, and certainly the bestselling: Kind of Blue. 3 Shades of Blue is James Kaplan’s magnificent account of the paths of the three giants to the mountaintop of 1959 and beyond. It’s a book about music, and business, and race, and heroin, and the towns that gave jazz its home, from New Orleans and New York to Kansas City, Philadelphia, Chicago, and LA. It’s an astonishing meditation on creativity and the strange hothouses that can produce its full flowering. It’s a book about the great forebears of this golden age, particularly Charlie Parker and Dizzy Gillespie, and the disrupters, like Ornette Coleman, who would take the music down truly new paths. And it’s about why the world of jazz most people know is a museum to this never-replicated period. But above all, 3 Shades of Blue is a book about three very different men—their struggles, their choices, their tragedies, their greatness. Bill Evans had a gruesome downward spiral; John Coltrane took the mystic’s path into a space far away from mainstream concerns. Miles had three or four sea changes in him before the end. The tapestry of their lives is, in Kaplan’s hands, an American odyssey with no direction home. It is also a masterpiece, a book about jazz that is as big as America.",
    "pageCount": 421,
    "printType": "BOOK",
    "categories": [
      "Biography & Autobiography"
    ],
    "thumbnail": "https://books.google.com/books/content?id=t5zDEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api&w=512",
    "language": "en",
    "link": "https://play.google.com/store/books/details?id=t5zDEAAAQBAJ"
  },
  {
    "isbn": "9780525511809",
    "dateFinished": "2024-03-21",
    "status": "finished",
    "rating": "unrated",
    "tags": [
      "nonfiction",
      "history"
    ],
    "title": "When Crack Was King",
    "authors": [
      "Donovan X. Ramsey"
    ],
    "publishedDate": "2023-07-11",
    "description": "LONGLISTED FOR THE NATIONAL BOOK AWARD • A “vivid and frank” (NPR) account of the crack cocaine era and a community’s ultimate resilience, told through a cast of characters whose lives illuminate the dramatic rise and fall of the epidemic “A master class in disrupting a stubborn narrative, a monumental feat for the fraught subject of addiction in Black communities.”—The Washington Post “A poignant and compelling re-examination of a tragic era in America history . . . insightful . . . and deeply moving.”—Bryan Stevenson, author of the #1 New York Times bestseller Just Mercy ONE OF THE NEW YORK PUBLIC LIBRARY AND VULTURE’S TEN BEST BOOKS OF THE YEAR A BEST BOOK OF THE YEAR: Time, The Washington Post, NPR, Chicago Public Library, Publishers Weekly, She Reads, Electric Lit, The Mary Sue The crack epidemic of the 1980s and 1990s is arguably the least examined crisis in American history. Beginning with the myths inspired by Reagan’s war on drugs, journalist Donovan X. Ramsey’s exacting analysis traces the path from the last triumphs of the Civil Rights Movement to the devastating realities we live with today: a racist criminal justice system, continued mass incarceration and gentrification, and increased police brutality. When Crack Was King follows four individuals to give us a startling portrait of crack’s destruction and devastating legacy: Elgin Swift, an archetype of American industry and ambition and the son of a crack-addicted father who turned their home into a “crack house”; Lennie Woodley, a former crack addict and sex worker; Kurt Schmoke, the longtime mayor of Baltimore and an early advocate of decriminalization; and Shawn McCray, community activist, basketball prodigy, and a founding member of the Zoo Crew, Newark’s most legendary group of drug traffickers. Weaving together riveting research with the voices of survivors, When Crack Was King is a crucial reevaluation of the era and a powerful argument for providing historically violated communities with the resources they deserve.",
    "pageCount": 449,
    "printType": "BOOK",
    "categories": [
      "History"
    ],
    "thumbnail": "https://books.google.com/books/content?id=2O6mEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api&w=512",
    "language": "en",
    "link": "https://books.google.com/books/about/When_Crack_Was_King.html?hl=&id=2O6mEAAAQBAJ"
  },
  {
    "isbn": "9781524732851",
    "dateFinished": "2024-03-28",
    "status": "finished",
    "rating": "unrated",
    "tags": [
      "nonfiction",
      "climate"
    ],
    "title": "Fire Weather",
    "authors": [
      "John Vaillant"
    ],
    "publishedDate": "2023-06-06",
    "description": "A NEW YORK TIMES TOP TEN BOOK OF THE YEAR • FINALIST FOR THE NATIONAL BOOK AWARD IN NONFICTION • A stunning account of a colossal wildfire and a panoramic exploration of the rapidly changing relationship between fire and humankind from the award-winning, best-selling author of The Tiger and The Golden Spruce • Winner of the Baillie Gifford Prize for Non-Fiction A BEST BOOK OF THE YEAR: The New York Times, The Washington Post, The New Yorker, TIME, NPR, Slate, and Smithsonian “Grips like a philosophical thriller, warns like a beacon, and shocks to the core.\" —Robert Macfarlane, bestselling author of Underland “Riveting, spellbinding, astounding on every page.” —David Wallace-Wells, #1 bestselling author of The Uninhabitable Earth In May 2016, Fort McMurray, the hub of Canada’s oil industry and America’s biggest foreign supplier, was overrun by wildfire. The multi-billion-dollar disaster melted vehicles, turned entire neighborhoods into firebombs, and drove 88,000 people from their homes in a single afternoon. Through the lens of this apocalyptic conflagration—the wildfire equivalent of Hurricane Katrina—John Vaillant warns that this was not a unique event, but a shocking preview of what we must prepare for in a hotter, more flammable world. Fire has been a partner in our evolution for hundreds of millennia, shaping culture, civilization, and, very likely, our brains. Fire has enabled us to cook our food, defend and heat our homes, and power the machines that drive our titanic economy. Yet this volatile energy source has always threatened to elude our control, and in our new age of intensifying climate change, we are seeing its destructive power unleashed in previously unimaginable ways. With masterly prose and a cinematic eye, Vaillant takes us on a riveting journey through the intertwined histories of North America’s oil industry and the birth of climate science, to the unprecedented devastation wrought by modern forest fires, and into lives forever changed by these disasters. John Vaillant’s urgent work is a book for—and from—our new century of fire, which has only just begun.",
    "pageCount": 0,
    "printType": "BOOK",
    "categories": [
      "Nature"
    ],
    "thumbnail": "https://books.google.com/books/content?id=lJeTEAAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api&w=512",
    "language": "en",
    "link": "https://books.google.com/books/about/Fire_Weather.html?hl=&id=lJeTEAAAQBAJ"
  },
  {
    "isbn": "9780063037335",
    "dateFinished": "2024-04-03",
    "status": "finished",
    "rating": "unrated",
    "tags": [
      "nonfiction",
      "autobiography"
    ],
    "title": "Finding Me",
    "authors": [
      "Viola Davis"
    ],
    "publishedDate": "2022-04-26",
    "description": "OPRAH’S BOOK CLUB PICK • A HARPERS BAZAAR BEST BOOK OF 2022 • A PARADE MOST ANTICIPATED BOOK • A MARIE CLAIRE MOST ANTICIPATED BOOK “It’s clear from the first page that Davis is going to serve a more intimate, unpolished account than is typical of the average (often ghost-written) celebrity memoir; Finding Me reads like Davis is sitting you down for a one-on-one conversation about her life, warts and all.”—USA Today “[A] fulfilling narrative of struggle and success….Her gorgeous storytelling will inspire anyone wishing to shed old labels.”—Los Angeles Times In my book, you will meet a little girl named Viola who ran from her past until she made a life-changing decision to stop running forever. This is my story, from a crumbling apartment in Central Falls, Rhode Island, to the stage in New York City, and beyond. This is the path I took to finding my purpose but also my voice in a world that didn’t always see me. As I wrote Finding Me, my eyes were open to the truth of how our stories are often not given close examination. We are forced to reinvent them to fit into a crazy, competitive, judgmental world. So I wrote this for anyone running through life untethered, desperate and clawing their way through murky memories, trying to get to some form of self-love. For anyone who needs reminding that a life worth living can only be born from radical honesty and the courage to shed facades and be . . . you. Finding Me is a deep reflection, a promise, and a love letter of sorts to self. My hope is that my story will inspire you to light up your own life with creative expression and rediscover who you were before the world put a label on you.",
    "pageCount": 282,
    "printType": "BOOK",
    "categories": [
      "Biography & Autobiography"
    ],
    "thumbnail": "https://books.google.com/books/content?id=gl05EAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api&w=512",
    "language": "en",
    "link": "https://play.google.com/store/books/details?id=gl05EAAAQBAJ"
  },
  {
    "isbn": "9781039000780",
    "dateFinished": "2024-04-10",
    "status": "finished",
    "rating": "unrated",
    "tags": [
      "tech",
      "nonfiction"
    ],
    "title": "Sideways",
    "authors": [
      "Josh O'Kane"
    ],
    "publishedDate": "2022-09-13",
    "description": "NATIONAL BESTSELLER From the Globe and Mail tech reporter who revealed countless controversies while following the Sidewalk Labs fiasco in Toronto, an uncompromising investigation into the bigger story and what the Google sister company's failure there reveals about Big Tech, data privacy and the monetization of everything. When former New York deputy mayor Dan Doctoroff landed in Toronto, promising a revolution in better living through technology, the locals were starstruck. In 2017 a small parcel of land on the city's woefully underdeveloped lakeshore was available for development, and with Google co-founder Larry Page and his trusted chairman Eric Schmidt leaning into Sidewalk Labs' pitch for the long-forsaken property—with Doctoroff as the urban-planning company's CEO—Sidewalk's bid crushed the competition. But as soon as the bid was won, cracks appeared in the partnership between Doctoroff's team and Waterfront Toronto, the government-sponsored organization behind the contest. There were hundreds more acres of undeveloped former port lands nearby that kept creeping into conversation with Sidewalk, and more questions were emerging than answers about how much the public would actually benefit from the Alphabet-owned company's vision for the high-tech neighbourhood—and the data it could harvest from the people living there. Alarm bells began ringing in the city's corridors of power and activism. To Torontonians accustomed to big promises with little follow-through, the fiasco that unfolded seemed at first like just another city-building sideshow. But the pained battle to reel in the power of Sidewalk Labs became a crucible moment in the worldwide battle for privacy rights and against the extension of Big Tech’s digital might into the physical world around us. With extensive contacts on all sides of the debacle, O'Kane tells a story of global consequence fought over a small, forgotten parcel of mud and pavement, taking readers from California to New York to Toronto to Berlin and back again. In the tradition of extraordinary boardroom dramas like Bad Blood and Super Pumped, Sideways vividly recreates the corporate drama and epic personalities in this David-and-Goliath battle that signalled to the world that all may not be lost in the effort to contain the rapidly growing power of Big Tech.",
    "pageCount": 0,
    "printType": "BOOK",
    "categories": [
      "Business & Economics"
    ],
    "thumbnail": "https://books.google.com/books/content?id=GJKTEAAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api&w=512",
    "language": "en",
    "link": "https://books.google.com/books/about/Sideways.html?hl=&id=GJKTEAAAQBAJ"
  }
]