{"id":"https://coryd.dev/posts/2024/dont-be-afraid-to-admin-when-you-dont-know-something/","title":"Don’t be afraid to admit when you don’t know something","link":"https://coryd.dev/posts/2024/dont-be-afraid-to-admin-when-you-dont-know-something/","published":1712778000000,"description":"I often apply this thinking to development work but I’ve found it holds true in many other situations. I’ve dealt with imposter syndrome for my whole career and still battle with it. I’m a self-taught developer and am confident that there’s more I don’t know than I do know.I’ve been asked when interviewing for a front end ecommerce position how the Javascript event loop works — in detail. I told the interviewer I didn’t know, had never needed to in previous positions but was confident I could figure it out. They hired me. I’ve taken a similar tack when discussing other roles with interviewers — I don’t know, but I like to learn and I’ll figure it out. Don’t know enough React? I’ll learn. Don’t know bespoke framework/internal tool X? I’ll learn.This has also been something I tell junior developers I’ve mentored and something I prize when it’s exhibited. Everyone on a team excels at something, or many things and there will be overlap, but the gaps are where you can help and teach each other. Don’t waste an opportunity to learn and don’t struggle when you don’t need to.Don’t fight through a problem. Read the docs and ask questions from there. I’ve learned from the open web, from taking apart applications and tools and I’ve learned even more from gracious senior developers. Being able to teach something to someone else is a great way to verify that you truly understand something.Be kind, help each other out and everyone gets better together.  It’s been a foundational part of all the best teams I’ve been on.This is a full text feed, but not all content can be rendered perfeclty within the feed. If something looks off, feel free to visit my site for the original post.","pubDate":"Wed, 10 Apr 2024 19:40:00 GMT"}